{
    "CHECKLISTS": [{
        "title": "Revues de code",
        "subparts": [{
            "name": "Java",

            "iswip": true,
            "author": "GORTAIS, Gwendal",
            "steps": [{
                    "libelle": "[Nommage] Les noms de classes / variables appartiennent aux groupes nominaux",
                    "desc": "Les noms de classes / variables représentent un objet en particulier et ne doivent pas être trop génériques"
                },
                {
                    "libelle": "[Nommage] Les noms de méthodes appartiennent aux groupes verbaux",
                    "desc": "Les méthodes représentent des actions."
                },
                {
                    "libelle": "[Nommage] Les variables ou méthodes booléennes ont une forme interrogative",
                    "desc": "Les variables de type booléen ou les méthodes qui renvoient un booléen répondent à une question."
                },
                {
                    "libelle": "[Nommage] Les propriétés d'énumérateurs sont des adjectifs",
                    "desc": "Les énumérateurs référencent des états. Ex: Red, Small, Pending..."
                },
                {
                    "libelle": "[Nommage] Les noms d'évènements sont déclinés au passé",
                    "desc": "Les évènements sont des actions passées. Ex: statusChanged, serverStarted..."
                },
                {
                    "libelle": "[Méthode] Les méthodes sont correctement indentées et aérées",
                    "desc": "Partager les mêmes formats de développement au sein de l'équipe. Ex : Plugin EditorConfig."
                },
                {
                    "libelle": "[Méthode] Les méthodes n'acceptent pas plus de X paramètres",
                    "desc": "Si le nombre de paramètres dépassent X, il faut remettre en question la méthode. Il est possible d'utiliser un objet, avec un nom parlant, pour porter un ensemble cohérent de paramètre. \n Exception : Lorsque la signature d'une méthode est imposée par un framework ou une librairie externe, il est possible de mettre en place une couche de mapping."
                },
                {
                    "libelle": "[Méthode] Les méthodes ne retournent jamais 'null'",
                    "desc": "Cela évite aux appelants de se prémunir contre les NullPointerException. N.B. : Renvoyer un objet / une liste vide ou utiliser le concept Option fourni depuis Java 8."
                },
                {
                    "libelle": "[Méthode] Les méthodes ne font qu'une seule action",
                    "desc": "Si le nom de méthode contient 'et', 'ou', 'avec', 'ainsi'... C'est qu'elle fait plusieurs actions. Cela augmente inutilement le complexité de la méthode, la rendant moins lisible et moins maintenable."
                },
                {
                    "libelle": "[Méthode] Aucune méthode n'est appelée avec la valeur null passée en paramètre",
                    "desc": "S'il est nécessaire de passer la valeur null à une méthode, c'est qu'elle fait plusieurs actions en fonction de la valeur du paramètre, une lorsque la valeur est nulle et une autre dans le cas contraire. Il est donc nécessaire de rentrer dans la méthode pour comprendre quel comportement est implémenté en fonction de la valeur des paramètres. Il est préférable de créer deux méthodes distinctes pour augmenter la lisibilité, la maintenabilité et la testabilité du code."
                },
                {
                    "libelle": "[Méthode] Aucune méthode n'accepte de valeur booléenne en paramètre",
                    "desc": "Sauf exception de l'état d'un objet, s'il est nécessaire de passer une valeur booléenne à une méthode, c'est qu'elle fait plusieurs actions, une si la valeur est vraie et une autre dans le cas contraire. Il est préférable de créer deux méthodes distinctes (cf. ci-dessus)."
                },
                {
                    "libelle": "[Méthode] Le code ne contient pas de 'magic numbers' ou de valeurs en dur",
                    "desc": "https://fr.wikipedia.org/wiki/Nombre_magique_(programmation). Préférer l'utilisation de constantes."
                },
                {
                    "libelle": "[Méthode] Les étapes et le résultat d'exécution de la méthode sont correctement tracés",
                    "desc": "Les niveaux de trace doivent être définis collégialement avec l'équipe. Pour rappel, les traces permettent d'observer la bonne exécution de la méthode, et de diagnostiquer et débogger en cas d'erreur."
                },
                {
                    "libelle": "[Méthode] Toutes les méthodes publiques sont testées",
                    "desc": "Toutes les méthodes publiques contenant de la logique métier doivent être testées."
                },
                {
                    "libelle": "[Méthode] Les méthodes respectent la loi 'Demeter' ou 'Principe de Connaissance Minimale'",
                    "desc": "Chaque méthode a uniquement connaissance de ses objets voisins pour avoir un code plus maintenable."
                },
                {
                    "libelle": "[Méthode] Une méthode n'implémente pas un comportent déjà implémenté ailleurs dans l'application",
                    "desc": "DRY (Don't Repeat yourself). Eviter les duplications de code."
                },
                {
                    "libelle": "[Méthode] Aucune méthode ne contient de switch (ou plusieurs séquences de 'if') non isolé dans le code",
                    "desc": "Utiliser les possibilités offertes par la POO et le polymorphisme"
                },
                {
                    "libelle": "[Méthode] Tous les paramètres des méthodes sont déclarés 'final'",
                    "desc": "Les méthodes ne doivent pas modifier les paramètres entrants, au risque de réduire la lisibilité et la maintenabilité du code."
                },
                {
                    "libelle": "[Méthode] Les méthodes ont une seule entrée et une seule sortie",
                    "desc": "Stocker le résultat de la méthode dans une variable avec retour à la fin. Exception: Sauf si le retour aide à la compréhension de la méthode ou à sortir au plus tôt de la méthode (vérification des paramètres)."
                },
                {
                    "libelle": "[Méthode] Une méthode n'implémente pas un comportent déjà implémenté ailleurs dans l'application",
                    "desc": "DRY (Don't Repeat yourself). Eviter les duplications de code."
                },
                ,
                {
                    "libelle": "[Méthode] Toutes les données configurables sont externalisées",
                    "desc": "Toute information susceptible de changer dans le temps ou en fonction de l'environnement doit être externalisé dans un fichier, en base ou dans un système clé/valeur (Consul) pour ne pas avoir à modifier et recompiler le code à chaque modification."
                },
                {
                    "libelle": "[Condition] Préférer une condition positive à une condition négative",
                    "desc": "Ex: if (isNotLate) vs if (!isLate)"
                },
                {
                    "libelle": "[Conditon] Les conditions complexes sont isolées dans une méthode",
                    "desc": "Isoler une condition complexe dans une méthode permet d'améliorer la lisibilité, la maintenabilité et la testabilité du code."
                },
                {
                    "libelle": "[Classe] Les classe ont une seule responsabilité",
                    "desc": "Respect du principe SOLID, Single Responsability Principle. Préférer plusieurs classes simples à une grosse classe complexe."
                },
                {
                    "libelle": "[Classe] Les classes ont un couplage faible entre elles",
                    "desc": "Interroger la modélisation et la conception de la classe en cas d'imports trop nombreux."
                },
                {
                    "libelle": "[Trace] Les traces contiennent des informations utiles.",
                    "desc": "Ex: Chaque trace contient les informations du contexte d'exécution courant. Le niveau de trace est cohérent avec l'information tracée."
                },
                {
                    "libelle": "[Commentaire] Les commentaires sont utiles",
                    "desc": "Ex: Chaque trace contient les informations du contexte d'exécution courant. Le niveau de trace est cohérent avec l'information tracée."
                },
                {
                    "libelle": "[Test] Les tests explicitent le comportement fonctionnel attendu.",
                    "desc": "Le nom de la méthode de test permet de comprendre rapidement l'intention du test. Ex: should_throw_exception_if_person_null..."
                },
                {
                    "libelle": "[Test] Chaque test ne valide qu'une seule règle technique/fonctionnelle",
                    "desc": "Exception: Une validation logique peut contenir plusieurs règles."
                },
                {
                    "libelle": "[Test] Les tests sont indépendants (atomiques et isolés)",
                    "desc": "Les tests ne doivent pas dépendre d'une connexion, d'une date, etc."
                },
                {
                    "libelle": "[Test] Les tests respectent la même arborescence que le code",
                    "desc": "Permet de retrouver plus facilement la classe associée au test."
                },
                {
                    "libelle": "[Exception] Favoriser les exceptions métiers",
                    "desc": "Eviter les exceptions techniques pour aider à mieux comprendre le problème."
                },
                {
                    "libelle": "[Exception] Limiter la portée des try-catch",
                    "desc": "Afin d'améliorer les lisibilités et la maintenabilité du code"
                },
                {
                    "libelle": "[Exception] Préférer les exceptions personnalisées",
                    "desc": "Aux retours de codes d'erreur afin de rendre le code le plus compact et d'éviter trop de conditions"
                },
                {
                    "libelle": "[Exception] Préférer l'utilisation des exceptions non vérifiées",
                    "desc": "Les exceptions doivent principalement hériter de la classe RuntimeException afin de ne pas polluer le code dans les couches autres que celles où les erreurs se sont produites"
                }
            ]
        }]
    }, {
            "title": "Definition of done",
            "subparts": [{
                    "name": "DOD TDD Style",

                    "iswip": false,
                    "author": "GORTAIS, Gwendal",
                    "steps": [{
                            "libelle": "Toutes les exigences fonctionnelles sont testées unitairement",
                            "desc": "Toutes les règles de gestion doivent être testées, avec tous les cas fonctionnels inhérents. Les données de tests doivent être externalisées et aisément modifiables (BDD ou fichier)."
                        },
                        {
                            "libelle": "La fonctionnalité est développée",
                            "desc": "La fonctionnalité est achevée lorsqu'elle répond à toutes les exigences de la spécification et que tous les tests fonctionnels sont passants."
                        },
                        {
                            "libelle": "Toutes les méthodes utilitaires sont testées",
                            "desc": "Toutes les méthodes utilitaires (parsing date, parsing fichier, parsing chaines...) doivent être externalisées et testées."
                        },
                        {
                            "libelle": "Tous les messages applicatifs affichés à l'utilisateur sont externalisés",
                            "desc": "Tous les messages applicatifs susceptibles d'être affichés à l'utilisateur doivent être externalisés dans des fichiers d'internationalisation (i18n). ex: messages_fr_fr.properties"
                        },
                        {
                            "libelle": "(Bonus) Toutes les traces applicatives sont externalisées",
                            "desc": "On pourra considérer comme un agrément appréciable que toutes les traces applicatives soient également externalisées dans des fichiers i18n, lorsqu'elles diffèrent du message affiché à l'utilisateur."
                        },
                        {
                            "libelle": "Les valeurs des propriétés métiers sont externalisées et portent des noms compréhensibles",
                            "desc": "Toutes les propriétés susceptibles de varier (référentiel, règles de gestion, autre) doivent être définies en dehors du code source pour éviter des recherches fastidieuses à chaque mise à jour (BDD ou fichier)."
                        },
                        {
                            "libelle": "Les valeurs des propriétés techniques doivent être externalisées",
                            "desc": "Toutes les propriétés susceptibles de varier en fonction des environnements (Pagination, chemins, connexions externes, nombre de treads...) doivent être externalisées, en base de données ou dans des fichiers. Pour les langages compilés, les fichiers de configuration (properties, json) doivent être stockés dans un composant distinct, pour éviter une nouvelle compilation du livrable en cas de mise à jour."
                        },
                        {
                            "libelle": "Le projet se construit correctement",
                            "desc": "Toutes les étapes de construction du projet doivent s'exécuter correctement, y compris les tests. Le temps de compilation ne doit pas excéder 10 minutes (Temps défini par l'équipe)."
                        },
                        {
                            "libelle": "L'exécutable ne contient que des dépendances validées",
                            "desc": "Toutes les dépendances contenues dans le livrable sont des releases. Elles sont toutes passées par un processus de validation. (Pas de Snapshots)"
                        },
                        {
                            "libelle": "Le livrable ne contient aucun fichier ou librairie inutile à son exécution",
                            "desc": "Attention à ne pas embarquer des fichiers de configuration ou des librairies qui ne sont nécessaires qu'en local."
                        },
                        {
                            "libelle": "La documentation est à jour, le cas échéant",
                            "desc": "Si la nouvelle fonctionnalité ou le correctif le nécessite, la documentation doit être à jour. Ex: modification de configuration sur les enviromments, sur la PIC ou sur le poste de dev..."
                        },
                        {
                            "libelle": "La demande de mise à disposition a été validée",
                            "desc": "La merge request ou pull request (ou toute autre opération de release management) a été acceptée. Le code a été revu par un pair."
                        },
                        {
                            "libelle": "L'application fonctionne correctement",
                            "desc": "La modification du code source n'a pas entrainé de régressions sur l'application. "
                        },
                        {
                            "libelle": "La nouvelle fonctionnalité répond aux exigences fonctionnelles",
                            "desc": "Les équipes de recette ou les tests automatisés ont permis de valider le fonctionnement de l'application"
                        }
                    ]
                },
                {
                  "name": "DOD Pull Request",

                  "iswip": false,
                  "author": "Kevin Jaouen",
                  "steps": [{
                          "libelle": "Le code compile",
                          "desc": ""
                      },
                      {
                          "libelle": "La revue a été effectuée par une autre personne que celle ayant effectuée le développement",
                          "desc": ""
                      },
                      {
                          "libelle": "Les normes de développement sont respectées",
                          "desc": "Pré-requis : les normes de développement ont été partagées avec l'équipe"
                      },
                      {
                          "libelle": "La couverture de test respect le seuil minimal défini par l'équipe",
                          "desc": "Pré-requis : Définir un seuil minimal de couverture."
                      },
                      {
                          "libelle": "Les tests passent",
                          "desc": ""
                      },
                      {
                          "libelle": "La quality gate ne remonte pas de violations bloquantes ou critiques",
                          "desc": ""
                      },
                      {
                          "libelle": "Les développements répondent aux exigences fonctionnelles",
                          "desc": "Autant techniquement (architecture & performance) que fonctionnellement"
                      },
                      {
                          "libelle": "Toutes les remarques effectuées lors de la revue ont été prises en compte",
                          "desc": ""
                      },
                      {
                          "libelle": "Si un changelog est présent, il doit être mise à jour",
                          "desc": ""
                      }
                  ]
              },
                {
                    "name": "DOD API",

                    "iswip": true,
                    "author": "CASSARD, Benjamin",
                    "steps": [{
                            "libelle": "Sonar passant (vert)",
                            "desc": ""
                        },
                        {
                            "libelle": "Pas d'erreur de test dans le job (de toute façon ça bloque les releases)",
                            "desc": ""
                        },
                        {
                            "libelle": "Pas de config en dur ciblant des environnements côté serveur",
                            "desc": ""
                        },
                        {
                            "libelle": "Pas de profil de config d'environnement",
                            "desc": ""
                        },
                        {
                            "libelle": "Pas de modification d'endpoint (type retour, chemin, ajout de param requis, suppression de param)",
                            "desc": ""
                        },
                        {
                            "libelle": "Que les sécurités de endpoints soient bien posées (Admin et ou user et pas de 'or not Authentificated')",
                            "desc": ""
                        },
                        {
                            "libelle": "Readme renseigné sur les evols",
                            "desc": ""
                        },
                        {
                            "libelle": "Tests pour les nouvelles APIs",
                            "desc": ""
                        },
                        {
                            "libelle": "Washer passant",
                            "desc": ""
                        },
                        {
                            "libelle": "Documentation swagger à jour (soit en annotations sur les endpoints, soit dans le swagger.yaml)",
                            "desc": ""
                        },
                        {
                            "libelle": "Pas de dépendances SNAPSHOT",
                            "desc": ""
                        }
                    ]
                }
            ]
        },
        {
            "title": "Architecture applicative",
            "subparts": [{
                    "name": "Front",

                    "iswip": true,
                    "author": "GORTAIS, Gwendal",
                    "steps": [{
                            "libelle": "Gestion des exceptions",
                            "desc": "La gestion des exceptions doit être décrite et implémentée de manière globale. "
                        },
                        {
                            "libelle": "Gestion des messages",
                            "desc": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
                        },
                        {
                            "libelle": "Gestion de la configuration",
                            "desc": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
                        },
                        {
                            "libelle": "Organisation des packages",
                            "desc": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
                        }
                    ]
                },
                {
                    "name": "Back",

                    "iswip": true,
                    "author": "GORTAIS, Gwendal",
                    "steps": [{
                            "libelle": "Gestion des exceptions",
                            "desc": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
                        },
                        {
                            "libelle": "Gestion des messages",
                            "desc": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
                        },
                        {
                            "libelle": "Gestion de la configuration",
                            "desc": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
                        },
                        {
                            "libelle": "Organisation des packages",
                            "desc": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
                        }
                    ]
                }
            ]
        },
        {
            "title": "CI / CD",
            "subparts": [{
                "name": "Basic",

                "iswip": true,
                "author": "GORTAIS, Gwendal",
                "steps": [{
                        "libelle": "Gestion des dépendances",
                        "desc": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
                    },
                    {
                        "libelle": "Construction des livrables",
                        "desc": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
                    },
                    {
                        "libelle": "Cycle de vie des composants",
                        "desc": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
                    },
                    {
                        "libelle": "Gestion des versions",
                        "desc": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
                    },
                    {
                        "libelle": "Gestion des livraisons",
                        "desc": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
                    },
                    {
                        "libelle": "Gestion des branches",
                        "desc": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
                    },
                    {
                        "libelle": "Qualité des livrables",
                        "desc": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
                    }
                ]
            }]
        },
        {
            "title": "Méthodologie",
            "subparts": [{
                "name": "Projet",
                "iswip": true,
                "author": "GORTAIS, Gwendal",
                "steps": [{
                        "libelle": "Typologie des tests (TU/TI…)",
                        "desc": "To add ngx-markdown library to your `package.json` use the following command. \n ```bash \n npm install ngx-markdown --save \n```"
                    },
                    {
                        "libelle": "Couverture de test (mesure)",
                        "desc": "To activate [Prism.js](http://prismjs.com/) syntax highlight you will need to include... \n - prism.js core library - `node_modules/prismjs/prism.js` file \n - a highlight css theme - from `node_modules/prismjs/themes` directory \n - desired code language syntax files - from `node_modules/prismjs/components` directory"
                    },
                    {
                        "libelle": "Gestion des JDD de test",
                        "desc": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
                    },
                    {
                        "libelle": "Documentation",
                        "desc": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
                    },
                    {
                        "libelle": "Partage de la connaissance",
                        "desc": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
                    },
                    {
                        "libelle": "TDD, BDD, Pair Programming",
                        "desc": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
                    },
                    {
                        "libelle": "Revue de code",
                        "desc": "Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum."
                    }
                ]
            }]
        }
    ]
}